wssmith/Sensor-Watch/SensorWatch/tinyusb/hw/mcu/silabs/cmsis-dfp-efm32gg12b/SVD/EFM32GG12B/EFM32GG12B530F512GL120.svd
        <register>
          <name>OPA3_OUT</name>
          <description>Operational Amplifier Output Configuration Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00FF01FF</resetMask>
          <fields>
            <field>
              <name>MAINOUTEN</name>
              <description>OPAx Main Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALTOUTEN</name>
              <description>OPAx Alternative Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTOUTEN</name>
              <description>OPAx Aport Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHORT</name>
              <description>OPAx Main and Alternative Output Short</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALTOUTPADEN</name>
              <description>OPAx Output Enable Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT0</name>
                  <description>Alternate Output 0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT1</name>
                  <description>Alternate Output 1</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT2</name>
                  <description>Alternate Output 2</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT3</name>
                  <description>Alternate Output 3</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT4</name>
                  <description>Alternate Output 4</description>
                  <value>0x00000010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APORTOUTSEL</name>
              <description>OPAx APORT Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA3_CAL</name>
          <description>Operational Amplifier Calibration Register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000080E7</resetValue>
          <resetMask>0x7DF6EDEF</resetMask>
          <fields>
            <field>
              <name>CM1</name>
              <description>Compensation Cap Cm1 Trim Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM2</name>
              <description>Compensation Cap Cm2 Trim Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM3</name>
              <description>Compensation Cap Cm3 Trim Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GM</name>
              <description>Gm Trim Value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GM3</name>
              <description>Gm3 Trim Value</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSETP</name>
              <description>OPAx Non-Inverting Input Offset Configuration Value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSETN</name>
              <description>OPAx Inverting Input Offset Configuration Value</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>IDAC0</name>
      <description>IDAC0</description>
      <baseAddress>0x40084000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IDAC0</name>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FD7FFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Current DAC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURSINK</name>
              <description>Current Sink Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOUTTRANS</name>
              <description>Minimum Output Transition Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTOUTEN</name>
              <description>APORT Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTOUTSEL</name>
              <description>APORT Output Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT1XCH0</name>
                  <description>APORT1X Channel 0</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH1</name>
                  <description>APORT1Y Channel 1</description>
                  <value>0x00000021</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH2</name>
                  <description>APORT1X Channel 2</description>
                  <value>0x00000022</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH3</name>
                  <description>APORT1Y Channel 3</description>
                  <value>0x00000023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH4</name>
                  <description>APORT1X Channel 4</description>
                  <value>0x00000024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH5</name>
                  <description>APORT1Y Channel 5</description>
                  <value>0x00000025</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH6</name>
                  <description>APORT1X Channel 6</description>
                  <value>0x00000026</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH7</name>
                  <description>APORT1Y Channel 7</description>
                  <value>0x00000027</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH8</name>
                  <description>APORT1X Channel 8</description>
                  <value>0x00000028</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH9</name>
                  <description>APORT1Y Channel 9</description>
                  <value>0x00000029</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH10</name>
                  <description>APORT1X Channel 10</description>
                  <value>0x0000002A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH11</name>
                  <description>APORT1Y Channel 11</description>
                  <value>0x0000002B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH12</name>
                  <description>APORT1X Channel 12</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH13</name>
                  <description>APORT1Y Channel 13</description>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH14</name>
                  <description>APORT1X Channel 14</description>
                  <value>0x0000002E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH15</name>
                  <description>APORT1Y Channel 15</description>
                  <value>0x0000002F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH16</name>
                  <description>APORT1X Channel 16</description>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH17</name>
                  <description>APORT1Y Channel 17</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH18</name>
                  <description>APORT1X Channel 18</description>
                  <value>0x00000032</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH19</name>
                  <description>APORT1Y Channel 19</description>
                  <value>0x00000033</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH20</name>
                  <description>APORT1X Channel 20</description>
                  <value>0x00000034</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH21</name>
                  <description>APORT1Y Channel 21</description>
                  <value>0x00000035</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH22</name>
                  <description>APORT1X Channel 22</description>
                  <value>0x00000036</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH23</name>
                  <description>APORT1Y Channel 23</description>
                  <value>0x00000037</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH24</name>
                  <description>APORT1X Channel 24</description>
                  <value>0x00000038</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH25</name>
                  <description>APORT1Y Channel 25</description>
                  <value>0x00000039</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH26</name>
                  <description>APORT1X Channel 26</description>
                  <value>0x0000003A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH27</name>
                  <description>APORT1Y Channel 27</description>
                  <value>0x0000003B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH28</name>
                  <description>APORT1X Channel 28</description>
                  <value>0x0000003C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH29</name>
                  <description>APORT1Y Channel 29</description>
                  <value>0x0000003D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH30</name>
                  <description>APORT1X Channel 30</description>
                  <value>0x0000003E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH31</name>
                  <description>APORT1Y Channel 31</description>
                  <value>0x0000003F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSEL</name>
              <description>Power Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM2DELAY</name>
              <description>EM2 Delay</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTMASTERDIS</name>
              <description>APORT Bus Master Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTOUTENPRS</name>
              <description>PRS Controlled APORT Output Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAINOUTEN</name>
              <description>Output Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAINOUTENPRS</name>
              <description>PRS Controlled Main Pad Output Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSSEL</name>
              <description>IDAC Output Enable PRS Channel Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected.</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected.</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH8</name>
                  <description>PRS Channel 8 selected.</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH9</name>
                  <description>PRS Channel 9 selected.</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH10</name>
                  <description>PRS Channel 10 selected.</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH11</name>
                  <description>PRS Channel 11 selected.</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH12</name>
                  <description>PRS Channel 12 selected.</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH13</name>
                  <description>PRS Channel 13 selected.</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH14</name>
                  <description>PRS Channel 14 selected.</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH15</name>
                  <description>PRS Channel 15 selected.</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CURPROG</name>
          <description>Current Programming Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x009B0000</resetValue>
          <resetMask>0x00FF1F03</resetMask>
          <fields>
            <field>
              <name>RANGESEL</name>
              <description>Current Range Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RANGE0</name>
                  <description>Current range set to 0 - 1.6 uA.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE1</name>
                  <description>Current range set to 1.6 - 4.7 uA.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE2</name>
                  <description>Current range set to 0.5 - 16 uA.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE3</name>
                  <description>Current range set to 2 - 64 uA.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STEPSEL</name>
              <description>Current Step Size Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING</name>
              <description>Tune the Current to Given Accuracy</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DUTYCONFIG</name>
          <description>Duty Cycle Configuration Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000002</resetMask>
          <fields>
            <field>
              <name>EM2DUTYCYCLEDIS</name>
              <description>Duty Cycle Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CURSTABLE</name>
              <description>IDAC Output Current Stable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>APORT Conflict Output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
